export const eventsData = [
    { id: 1, year: 988, title: "Хрещення Русі", period: "Середньовіччя", details: "Прийняття християнства князем Володимиром Великим." },
    { id: 2, year: 1596, title: "Утворення УГКЦ", period: "Новий час", details: "Берестейська унія, що об'єднала частину православної церкви з католицькою." },
    { id: 3, year: 1648, title: "Козацька революція", period: "Новий час", details: "Початок Національно-визвольної війни під проводом Богдана Хмельницького." },
    { id: 4, year: 1991, title: "Незалежність України", period: "Новітній час", details: "24 серпня 1991 року ухвалено Акт проголошення незалежності України." }
];


export const quizData = [
    {
        question: "У якому році було проголошено незалежність України?",
        options: ["1989", "1990", "1991", "1996"],
        correctAnswer: "1991"
    },
    {
        question: "Хто хрестив Київську Русь?",
        options: ["Ярослав Мудрий", "Володимир Великий", "Княгиня Ольга", "Князь Святослав"],
        correctAnswer: "Володимир Великий"
    },
    {
        question: "Хто очолив Національно-визвольну війну у 1648 році?",
        options: ["Іван Мазепа", "Петро Дорошенко", "Богдан Хмельницький", "Пилип Орлик"],
        correctAnswer: "Богдан Хмельницький"
    },
    {
        question: "Яка унія була підписана у 1596 році?",
        options: ["Люблінська унія", "Кревська унія", "Берестейська унія", "Гадяцька унія"],
        correctAnswer: "Берестейська унія"
    }
];